# IFCPartialSchemaSupport Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..IFCPartialSchemaSupport Property
BuiltInFailures..::..ImportFailures Class See Also
---
IFC versions 4 and above are only partially supported by Open IFC. Consider using Link IFC instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId IFCPartialSchemaSupport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IFCPartialSchemaSupport As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ IFCPartialSchemaSupport {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace